thanks for the issue however, i'm unable to replicate the issue you are seeing here. taking the steps from your repo, is all working here.
thanks for the issue however, i'm unable to replicate the issue you are seeing here. taking the steps from your repo, is all working here.

- create a resource on 4.1.0
  ```
  $ terraform init 

  Initializing the backend...

  Initializing provider plugins...
  - Finding cloudflare/cloudflare versions matching "4.1.0"...
  - Installing cloudflare/cloudflare v4.1.0...
  - Installed cloudflare/cloudflare v4.1.0 (self-signed, key ID C76001609EE3B136)

  Partner and community providers are signed by their developers.
  If you'd like to know more about provider signing, you can read about it here:
  https://www.terraform.io/docs/cli/plugins/signing.html

  Terraform has made some changes to the provider dependency selections recorded
  in the .terraform.lock.hcl file. Review those changes and commit them to your
  version control system if they represent changes you intended to make.

  Terraform has been successfully initialized!

  You may now begin working with Terraform. Try running "terraform plan" to see
  any changes that are required for your infrastructure. All Terraform commands
  should now work.

  If you ever set or change modules or backend configuration for Terraform,
  rerun this command to reinitialize your working directory. If you forget, other
  commands will detect it and remind you to do so if necessary.
  ```

  ```
  $ terraform apply -auto-approve

  Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
    + create

  Terraform will perform the following actions:

    # cloudflare_ruleset.cache_settings_example will be created
    + resource "cloudflare_ruleset" "cache_settings_example" {
        + description = "set cache settings for the request"
        + id          = (known after apply)
        + kind        = "zone"
        + name        = "set cache settings"
        + phase       = "http_request_cache_settings"
        + zone_id     = "0da42c8d2132a9ddaf714f9e7c920711"

        + rules {
            + action      = "set_cache_settings"
            + description = "example"
            + enabled     = true
            + expression  = "(http.host eq \"example.com\" and starts_with(http.request.uri.path, \"/example1\"))"
            + id          = (known after apply)
            + ref         = (known after apply)
            + version     = (known after apply)

            + action_parameters {
                + cache   = true
                + version = (known after apply)

                + cache_key {
                    + ignore_query_strings_order = true

                    + custom_key {
                        + query_string {
                            + exclude = [
                                + "text",
                              ]
                          }
                      }
                  }

                + edge_ttl {
                    + default = 7200
                    + mode    = "override_origin"
                  }
              }
          }
      }

  Plan: 1 to add, 0 to change, 0 to destroy.
  cloudflare_ruleset.cache_settings_example: Creating...
  cloudflare_ruleset.cache_settings_example: Creation complete after 1s [id=522bfb00aa064a97bb150438ef13ce23]

  Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
  ```
- upgrade provider to 4.8.0
  ```
  $ terraform init -upgrade

  Initializing the backend...

  Initializing provider plugins...
  - Finding cloudflare/cloudflare versions matching "4.8.0"...
  - Installing cloudflare/cloudflare v4.8.0...
  - Installed cloudflare/cloudflare v4.8.0 (self-signed, key ID C76001609EE3B136)

  Partner and community providers are signed by their developers.
  If you'd like to know more about provider signing, you can read about it here:
  https://www.terraform.io/docs/cli/plugins/signing.html

  Terraform has made some changes to the provider dependency selections recorded
  in the .terraform.lock.hcl file. Review those changes and commit them to your
  version control system if they represent changes you intended to make.

  Terraform has been successfully initialized!

  You may now begin working with Terraform. Try running "terraform plan" to see
  any changes that are required for your infrastructure. All Terraform commands
  should now work.

  If you ever set or change modules or backend configuration for Terraform,
  rerun this command to reinitialize your working directory. If you forget, other
  commands will detect it and remind you to do so if necessary.
  ```
- remove resource from state
  ```
  $ terraform state rm cloudflare_ruleset.cache_settings_example
  Removed cloudflare_ruleset.cache_settings_example
  Successfully removed 1 resource instance(s).
  ```
- import resource to state 
  ```
  $ terraform import cloudflare_ruleset.cache_settings_example zone/0da42c8d2132a9ddaf714f9e7c920711/522bfb00aa064a97bb150438ef13ce23
  cloudflare_ruleset.cache_settings_example: Importing from ID "zone/0da42c8d2132a9ddaf714f9e7c920711/522bfb00aa064a97bb150438ef13ce23"...
  cloudflare_ruleset.cache_settings_example: Import prepared!
    Prepared cloudflare_ruleset for import
  cloudflare_ruleset.cache_settings_example: Refreshing state... [id=522bfb00aa064a97bb150438ef13ce23]

  Import successful!

  The resources that were imported are shown above. These resources are now in
  your Terraform state and will henceforth be managed by Terraform.
  ```
- `plan` to confirm the diff
  ```
  $ terraform plan
  cloudflare_ruleset.cache_settings_example: Refreshing state... [id=522bfb00aa064a97bb150438ef13ce23]

  No changes. Your infrastructure matches the configuration.

  Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.
  ```

i would only expect to see the error you are receiving by going in the reverse of your reproduction case which is intended behaviour.